<!DOCTYPE html>
<html>
<head lang="zh-CN">
    <meta charset="UTF-8">
    <title>信息论-讨论交流</title>
    <link href=<?=base_url().'views/introduction/introduction.css'?> rel="stylesheet" type="text/css">
    <script src=<?=base_url().'views/common/jquery-2.2.3.min.js'?>></script>
    <!--IE8只能支持jQuery1.9-->
    <!--[if lte IE 8]>
    <link href="__PUBLIC__/Common/Css/IE.css" rel="stylesheet" type="text/css">
    <script src="http://apps.bdimg.com/libs/jquery/1.9.0/jquery.min.js"></script>
    <![endif]-->
    <script src=<?=base_url().'views/common/common.js'?>></script>
</head>
<body id="body">
<!--添加登录条-->
<include file="./loginBar"/>
<!--添加导航栏-->
<include file="./nav"/>

<div class="subNav">
    <p>
        <a href="#" data-target="list-leader" class="choose">主讲老师</a>
        <a href="#" data-target="list-achievement">教学成果</a>
        <a href="#" data-target="list-course">课程描述</a>
        <a href="#" data-target="list-history">发展历史</a>
        <a href="#" data-target="list-idea">教学理念</a>
        <a href="#" data-target="list-paper">论文发表</a>
        <a href="#" data-target="list-condition">教学条件</a>
        <a href="#" data-target="list-effect">教学效果</a>
        <a href="#" data-target="list-team">教学队伍</a>
        <a href="#" data-target="list-method">教学方法</a>
    </p>
    <button class="turn-right">&#9668;</button>
    <button class="turn-left">&#9658;</button>
</div>

<div class="intro-wrap">
    <section class="intro-list" id="list-leader">
        <h1>主讲老师</h1>
        <table>
            <tr>
                <td>姓名</td><td>李伟彤</td>
                <td>性别</td><td>男</td>
                <td>出生年月</td><td>1969-10</td>
            </tr>
            <tr>
                <td>最终学历</td><td>博士</td>
                <td>职称</td><td>副教授</td>
                <td>学科专业</td><td>信号与信息处理</td>
            </tr>
            <tr><td>学位</td><td>博士</td>
                <td>电话</td><td>18998498314</td>
                <td>E-mail</td><td>lwt1969@163.com</td>
            </tr>
            <tr><td>所在院系</td><td colspan="2">信息工程学院</td>
                <td>任教经验</td><td colspan="2"> 24 年</td>
            </tr>
        </table>
    </section>
    <section class="intro-list" id="list-achievement">
        <h1>教学成果</h1>
        <table cellspacing="0">
            <tr>
                <th>时间</th><th>项目名称</th><th>奖励名称</th><th>奖励级别</th>
            </tr>
            <tr>
                <td>2010</td>
                <td>工科院校实验课程化教学体系的构建与实施</td>
                <td>广东省优秀教学成果奖</td>
                <td>一等奖</td>
            </tr>
            <tr>
                <td>2008</td>
                <td>工科院校实验课程化教学体系的构建与实施</td>
                <td>广东工业大学教学成果奖</td>
                <td>一等奖</td>
            </tr>
            <tr>
                <td>2008</td>
                <td>产学研结合的工程训练管理新模式及实践</td>
                <td>广东工业大学教学成果奖</td>
                <td>一等奖</td>
            </tr>
            <tr>
                <td>2008</td>
                <td>网络教学资源与结构共建、共享的理论与实践</td>
                <td>广东工业大学教学成果奖</td>
                <td>一等奖</td>
            </tr>
            <tr>
                <td>2008</td>
                <td>柔性制造系统（FMS）专题学习网站</td>
                <td>省151工程现代教育技术优秀项目</td>
                <td>二等奖</td>
            </tr>
            <tr>
                <td>2005</td>
                <td>FMS网上虚拟实验室</td>
                <td>广东工业大学教育技术研究项目</td>
                <td>一等奖</td>
            </tr>
            <tr>
                <td>2005</td>
                <td>网络环境下新型教学模式与创新人才培养模式的研究与实践</td>
                <td>广东省高等教育教学成果奖</td>
                <td>一等奖</td>
            </tr>
        </table>
    </section>
    <section class="intro-list" id="list-course">
        <h1>课程描述</h1>
        <p>本课程作为电子科学与工程学院的一门重要的学科基础课程，经过多年的发展与建设，无论在师资队伍建设、教学改革、教材建设方面，还是在网络教学、实践教学、课件制作等各个方面均取得了一定的成绩。课程组历届负责人都以其扎实的学术修养和兢兢业业教书育人的师德师风受到广大师生的尊敬，在国内具有一定影响。
        </p>
        <p>同时课程组拥有一支稳定而充满活力的教学队伍，其学历层次和年龄结构合理。这些老师长期从事信息论与编码领域的科学研究，承担了数十项国家、军队及企业委托的研发项目，他们中有的是高产作者，有的是国优、省优论文获得者，在国内同行中产生了一定的学术知名度。他们经过层层筛选进入课程组，在老教员热情的传帮带下，在课程组持之以恒的严格制度督导下，迅速成长为优秀教师，其带队参赛和指导的学生在全国大学生电子设计及其信息安全专题邀请赛上频频获奖。
        </p>
        <p>
            在教学改革方面，多年的教学中我们一直没有停止改革创新的步伐。结合学术研究，不断地在跟踪信息理论与技术的新发展，及时扩充到课堂教学中。同时积极开展各种教育理论的学习，自觉投入教育研究和改革活动中，不断探索现代教育新方法。从教学内容的修改完善，教学大纲的更新，到提倡以学生为主体，尝试碎片式、反转式、微格、研讨式、自主参与式等各种教学方法，再到探索专业课双语教学模式，以及积极筹划将网络、多媒体、便携式实验平台等各种先进的教学手段运用于课堂教学，课程在教学改革方面走在省内同类课程的前列。
        </p>
        <p>
            在网络教学建设方面，《信息论与编码》课程网站，将设计成为师生课外交流的良好平台。该网站将向学习者提供丰富的学习资源，并具有在线测试、虚拟实验等功能单元，是学生进行自主学习和课后复习的有力保障。届时，利用丰富多样的案例教学、专题讲座、经典文献推荐及测试与虚拟实验可以有效帮助学生进行课前和课后的学习和讨论。
        </p>
        <p>
            综合以上各方面的建设情况可以看出，本课程开设历史久远，具有鲜明的课程特色，其整体水平属于省内同类课程先进水平。
        </p>

    </section>
    <section class="intro-list" id="list-history">
        <h1>发展历程</h1>
        <h3>（一）信息论在信息科学中的重要地位</h3>
        <p>
            信息论、控制论和系统论并称为信息科学的三大支柱理论，日益受到各方面的重视。信息理论不仅在通信领域发挥了越来越重要的作用，同时也迅速渗透到其他相关的自然科学与社会科学领域，对信息科学和信息产业有重要促进作用。</p>
        <h3>（二）该课程作为研究生学位课的重要地位</h3>
        <p>
            随着通信技术的不断发展，《信息论与编码》作为研究生学位课已经变得越来越重要，对相关课程及专业的普及与提高具有积极推动作用。多年的实践证明，该门课程为学生将来从事信息与通信领域研究开发和工程应用打下坚实的理论基础。可以帮助学生站在更高的角度理解当今数字化、信息化技术的发展与应用，对学生今后的发展具有重要意义。目前许多其他高校的信息类专业也都逐渐将《信息论与编码》作为研究生学位必修课程。</p>
        <h3>（三）课程发展过程</h3>
        <p>
            我院最初使用的教材《信息论基础理论与应用》是面向21世纪电子信息类教材，傅祖芸主编，电子工业出版社发行。该教材是在总结和借鉴国内外信息论教材的基础上编写而成，比较适合我校通信和信息工程专业。2005年之前，该课程只是讲授信息论部分，课程名称是《信息论基础》；从2005年申报者来我校工作开始加入编码理论，该课程的名称改为《信息论与编码》。</p>
        <h3>（四）教学内容发展变化和教学改革</h3>
        <p>
            由于信息论方面的许多教材内容十分抽象、难以理解。在长期教学实践中，我们对该课程进行了一些改革和探索，取得了一些成果，即针对工科研究生特点，在注重理论研究基础上，结合实际应用背景，补充阐述概念/定理的物理意义和应用环境。妥善处理好深度与广度的关系，加强理论与应用的结合，注重课程的实践性教学，让学生体验到将抽象理论应用于工程技术的基本原理和方法，深刻体会理论的严密性和工程应用的实用性。</p>
        <h3>（五）总体建设目标</h3>
        <p>
            我们的指导思路是：“以数学原理为基础，立足工程应用”，在教学内容、教学方法和手段、教学管理等方面进行改革，在授课质量和实践教学上严格把关，取得了良好的效果，利用先进的教学理念和扎实有效的工作，使本课程的整体建设水平与省内同类大学精品课程相当。</p>

    </section>
    <section class="intro-list" id="list-idea">
        <h1>教学思想</h1>
        <h3>（一）概念讲述注重物理意义的分析</h3>
        <p>
            本课程区别于其它专业基础课程的一大特色：信息理论部分抽象概念较多，如信息熵、平均互信息等。一般来说这些概念都是由数学模型引入，进而分析数学表达式，数学性质等，难于理解和记忆。而这些抽象概念的理解是课程学习的基础，因此，课程讲述时必须注重抽象概念物理意义的分析，让学生从具体的物理现象理解抽象概念，加强学生对概念的拓展和应用。</p>
        <h3>（二）将先进的通信技术引入课堂</h3>
        <p>
            通信技术发展日新月异，学生对先进的通信技术始终充满着好奇心，具有极强的探索欲望。在信息理论对于通信工程的指导意义中，引入了先进通信技术,一方面用于说明理论对于实践的指导，另一方面拓宽了学生的知识面，有利于加深其对信息理论的理解，提高了学生学习热情。</p>
        <h3>（三）采取多样化的教学方法</h3>
        <p>
            在《信息论与编码》课程的教学过程中，采用反转教学方法，避免“满堂灌”的情况，尽可能多地调动学生主动参与课堂的热情。我们将课程中部分内容留给某些学生，让他们自由发挥，进行讲授，扮演“教师”角色；将课程中某些重要内容（以问题形式给出）作为研讨议题，学生组织，教师引导，自由讨论。这些措施较好地调动学生的学习积极性和主动性，激发学生的求知欲与好奇心。讨论中不把相关结论直接告诉学生，而是要求学生在分析比较的基础上，自己总结归纳。这样学生既学会了思考，又在发现问题、分析问题、解决问题的过程中获得了知识，进而培养了他们自学的能力，有利于形成创新性思维。</p>
        <h3>（四）实践教学与理论教学相辅相成</h3>
        <p>
            《信息论与编码》课程的内容较为抽象，但其结论对通信技术有直接的指导作用。因此，通过合理设计实践教学内容和方式，可以有效促进理论教学。我们设计了多层次的课程实验，并且结合参考、实习，让学生对抽象的理论知识有更具体感性的认识。等通信体制的关键技术。实践教学与理论教学相互融合，相辅相成，将部分讲授内容以实践教学形式完成，而实践教学的一些结论又可作为课程教学有效的补充。实现理论与实践的有机结合，通过实践学习理论，利用理论来指导实践。</p>
        <h3>（五）多种实践教学手段提高学生综合能力</h3>
        <p>
            在《信息论与编码》的实践教学中，以课程实验为重点建设内容，严把“课题设计关”、“组织指导关”及“考核验收关”。针对学生所选择的实验科目，我们将相应实验的目的、内容及要求以“实验任务书”的形式发放给学生，要求学生自己拟定方案和步骤，对学生的能力培养起到了积极作用。在考核评估方面，要求学生必须按时完成实验，教师对实验结果进行现场检查验收，并要求准时递交实验报告，以克服学生杜撰、抄袭实验结果的弊端。教师根据实验表现和实验报告的具体内容综合评定其成绩。对于创新型实验，还需进行开题论证和结题报告等考核。学生通过查阅资料、开题论证、分组讨论、结题答辩等方式不仅扩展了所学的知识，而且体验了科学研究的全过程，激发了其学习和钻研的热情。这些方法使学生分析问题和解决问题的能力得到了极大地锻炼和加强，同时也培养了学生的团队协作精神。通过各种课程实验及课程设计的锻炼，提升了学生使用编程语言工具的能力，为日后的学习和实际工作打下了基础。</p>
    </section>
    <section class="intro-list" id="list-paper">
        <h1>论文发表</h1>
        <ul>
            <li>网络教育与创造性人才培养教学模式的理论与实践研究，《教育技术研究》，2002.1.</li>
            <li>关于加强实践教学的理论研究与建设的思考，《黑龙江高教研究》(核心)，2003.4.</li>
            <li>高校实验室工作若干问题的探讨，《实验教学改革与探索（四）》，中山大学出版社，2003.5.</li>
            <li>信息技术与实践课程整合的探索，《实验教学改革与探索（四）》，中山大学出版社，2003.5.</li>
            <li>网络教育与创造性人才培养教学模式的理论与实践研究，《电化教育研究》(核心)，2003.6.</li>
            <li>创设“双主模式”网络资源环境——构建专题学习网站，全国高等学校教育技术协作委员会第三届年会暨学术交流会，2003年12月19-21日，北京大学，北京.</li>
            <li>互动式实验教学模式之研究，《高教探索》(核心)，2004.1，p80-81.</li>
            <li>高校教师教学质量测评信息管理系统设计，《黑龙江高教研究》(核心)，2004,1.</li>
            <li>构建《测控技术与仪器》专业资源库，《教育技术研究》2004.7.</li>
        </ul>
    </section>
    <section class="intro-list" id="list-condition">
        <h1>教学条件</h1>
        <h3>（一）教材使用与建设（包括配套实验教材的教学效果）</h3>
        <p>
            该课程在2005年之前的名称为《信息论基础》，最初使用的教材《信息论基础理论与应用》是面向21世纪电子信息类教材，傅祖芸主编，电子工业出版社发行。该教材是在总结和借鉴国内外信息论教材的基础上编写而成，该课程只是讲授信息论部分。从2005年申报者来我校工作以后在原有信息论基础上加入编码理论，课程名称也相应改为《信息论与编码》。最开始使用的教材是东南大学沈连丰编写的《信息论与编码》，该教材是信息与通信工程研究生系列教材，科学出版社发行；然后使用姜丹编写的《信息论与编码》，中国科学技术出版社发行。教材使用发生变化的原因是：1.适应教学内容的改变；2.考虑到该课程的教材大多比较抽象难懂，学生自学和理解有难度。申报者计划在2年内筹划编写新教材，新教材既要充分考虑工科学校研究生培养的特殊性，针对工科研究生特点，在注重理论研究基础上，结合实际应用背景，补充阐述概念和定理的物理意义及其应用环境。妥善处理好深度与广度的关系，加强理论与应用的结合，注重课程的实践性教学。</p>
        <h3>（二）促进学生主动学习的扩充性资料使用情况（包括网络教学环境等）</h3>
        <p>
            目前的教材都无法提供相应的课件，申报者结合多种教材的优点编写了课件。学生反映该课件内容完整、条理清晰，前后关系连贯，非常容易理解，可以作为学生学习和自学的主要参考资料。另外安排一些课外题目，如信息论在图像性能评价的应用，信源和信道编解码设计实现等，鼓励学生课下查阅资料和编程实现。同时建立讨论学习小组，每个小组由4-5人组成，可以进行课下讨论，课上讲解等交流活动。多个小组可以互相进行交流、比较实验结果，老师负责组织和进行点评。建立网络预习和讨论群，进行网上提问、回答和讨论，也可以进行资料共享。
        </p>
        <h3>（三）实践性教学环境</h3>
        <p>
            广东工业大学信息工程专业具有良好的办学基础和积累，目前该专业拥有教授5名，副教授或相当职称的教师10名，45岁以下的青年教师占80%。2位教师荣获全国优秀教师荣誉称号、4位教师荣获南粤优秀教师/教坛新秀称号、5名青年教师被列为广东省“千百十”工程校级培养对象。
            实验室设备优良，拥有一批高水准的专业实验室，包括一个广东省重点实验室，两个广东省教育厅现代信息技术实验室和现代通信技术实验室、五个专业实验室（通信技术实验室、电子信息技术实验室、测控技术及微机应用实验室、计算机软件与网络实验室、工程训练实验室等），另建立了4个校外实习基地。近年来，教学实验室的投入逐年加大，2000年广东省教育厅投入300万元建设“现代信息技术实验室”，2001年学校投入170万元IT专项经费建设“现代通信技术实验室”，2003年学校投入120万元组建新专业实验室。实验室总面积达4900平方米，固定资产达1410万元。目前，实验室的仪器设备先进，功能齐全，已基本形成较为完善的实践教学环境与体系。与我省其它高校相同或相近专业相比，实验室条件是较为优越的。项目组成员都是广东工业大学信息学院教师，学院可以提供通信实验平台、DSP开发平台、FPGA开发平台、数字示波器等基本仪器设备。课题组已经购置部分开发板、可见光和红外摄像头、数据采集系统、触摸屏显示器等设备，用于前期研发。</p>
    </section>
    <section class="intro-list" id="list-effect">
        <h1>教学效果</h1>
        <h3>（一）校内督导对该课程提出的意见和建议如下：</h3>
        <p>
            《信息论与编码》课程是电子信息类专业的一门重要专业基础课，该课程在建设和改革中形成了自身特色。该课程“讲理论、重实践”，其讲授内容基于经典香农信息论、结合编码技术最新发展前沿，强调理论与应用的结合。课程组成员致力于《信息论与编码》课程建设，积极尝试教育教学方法创新，积极筹划课程网站教学资源丰富，推进网络教学开展；实验构思巧妙，专题讲座涵盖知识面广，实践教学层次感强。该课程拥有一支朝气蓬勃的教学团队，学历结构、学科结构合理；教学中运用研讨式、问题式等多种教学方法，教学效果好，体现了现代化教学理念。该课程在教学改革中颇有成效，逐渐形成鲜明的专业特色，主要特色有：
        </p>
        <p>
        1）增加课程实例。信息理论部分内容较为抽象，学生难于理解，针对这一情况，课程内容紧跟通信发展前沿，增加大量实例，通过现象看本质，进一步加深学生对信息理论核心内容的理解。
        </p>
        <p>
            2）理论讲解深刻、到位，逐渐与国际接轨。随着信息理论的不断发展，课程形式发生了一定的变化，该课程借鉴国外先进教学方法和理念，将专题及研讨引入课堂，极大提升学生学习热情，增强学生参与国际研究与讨论的信心。该课程在其它方面也取得了很大的成绩，编制了多媒体课件，积极开展网络教学，建设了试题库，并被广泛使用。
        </p>
        <p>
            深厚的学术积累使该课程在教学内容的组织上，能够很好地把握抽象理论与具体工程应用的结合关系，以通俗易懂、生动形象的方式阐述抽象概念的物理意义，在重基础的同时强调Shannon信息理论对通信系统优化设计的指导意义，提升了学生对通信工程一般规律的认识。另外采用各种专题讲座、分组调研等形式介绍信息论与编码理论的近期发展，拓广学生的学术视野，这也是一种符合现代教育趋势的好做法。在课程教学实施中，采用了精讲多练、师生互换互动等多种教学方法，并结合多媒体、网络课堂等现代化教学手段，构建起多层次、立体化的教学环境，帮助学生主动学习和自主学习。把最新的科研成果和设计理念贯彻到教学中，有效地激发了学生对本学科理论与技术的研究热情和创新能力，教学成果显著。在教师团队建设、课程特色、网络教学和题库建设等方面都做了大量的实际工作和具有很好的积淀。
        </p>
        <h3>（二）近三年学生的评价结果：</h3>
        <p>
            近三年以来，有近两百名左右研究生通过《信息论与编码》这门专业基础课程的学习，走上了工作岗位或继续深造。良好的课程教学，使师生之间建立了一种长久的友谊，许多学生在毕业离校后仍然和项目组人员保持着学术及思想交流的习惯。从他们的反映中可以看出本课程作为学科基础课对其产生了较深远的影响。以下为一些学生评价：<br/>
        </p>
        <p>（学生1）信息论与编码课程的学习，使得我更好的理解了本专业的其他课程，并很好地解决了实践上遇到的难点。信息论中包含的许多思想在网络安全和稳定性分析过程中有很好的借鉴，对我的工作大有帮助。 <br/>
        </p>
        <p>（学生2）通过《信息论与编码》的学习，使得我对信息科学有了更加系统的认识，了解如何用数学的方法来解释信息传输的过程。对于信息产生、传输和接收的过程有了深刻的理解，形成了具有严密理论支撑的知识构架。在这门课的学习过程中所建立起来的对信息系统的整体认识，帮助我在科研工作中能够迅速发现工作中的重点和难点，从而能够从一定的高度理解和把握工作进程。<br/>
        </p>
        <p>
            （学生3）这门课教学模式与众不同，至今给我印象深刻。课堂上老师解释概念直接、容易理解；同时老师会加入一些科技性的学习报告，与本科生阶段有很大不同，作用和效果非常明显。这些提高了我们的口头表达和阐述问题的能力，也锻炼了我们的自学能力。
            每做完一次报告，我对相关问题会有更深的认识和理解，而且还会有种成就感，激发起我的学习兴趣。<br/>
        </p>
        <p>
            （学生4）通过该课程的学习，我深入理解了“信息”的概念和信息论的相关知识，这些知识对我所从事的工作价值很大。除了学习课程知识，老师们注重启发我们的思维方法，培养我们的科学素养。老师在传授知识的时候，认真负责、严谨务实、一丝不苟、无私奉献的工作作风和精神也深深感染和影响了我。<br/>
        </p>
        <p>
            （学生5）老师细致的讲解，使大多数知识都能在课堂上及时消化。不时加入的一些启发式的提问，既加强了师生之间的互动交流，也让我们更加积极地投入到课程学习中。课后的思考题，以小组为单位，加强了同学之间思维的碰撞和交流。让我们自己来讲解这些思考题，更是给大家提供了一个展现自我风采的舞台。老师流利适时的讲解，也给我们诠释了教学的内涵。<br/>
        </p>
        <p>（学生6）通过《信息论与编码》的学习，我最大的收获是对信息论有了一个清晰的认识，建立起了通信系统有效性与可靠性的整体概念，这个概念的形成对我后来从事的科研工作十分重要。<br/>
        </p>
        <p>
            （学生7）通过《信息论与编码》课程的学习，在老师细致耐心的教导下，我第一次全面而系统的了解了信息论的相关知识，深刻理解了香农三大定理的科学内涵，懂得了信道容量是可靠传输的理论极限，利用压缩编码能够提高通信系统的有效性，信道编码则能提高通信系统的可靠性。
            尤其让我倍感兴趣的是老师精心安排的配套课程设计，所有这些使我对所学专业产生了浓厚的兴趣<br/>
        </p>
        <p>
            （学生8）通过信息论与编码这门课程的学习，我们掌握了信息量、熵、信道及其容量、香农三大定理等信息论的基本概念和基本原理，深刻理解了纠错编码和压缩编码理论，在实践中我们还培养了较强的编程能力和分析解决实际问题的能力，这些对我们参加科研工作都有极大的帮助。<br/>
        </p>
        <p>
            综上所述：教学效果实现了预期目标。不仅较好地完成了教学任务，还极大地激发了学生的学习兴趣，为其今后的学习和工作奠定了扎实的理论基础；教学突出特色，提高了学生针对问题进行资料查询、编程实现和解决实际问题的能力，对学生的自学能力和创新意识有很大的提高。
        </p>
    </section>
    <section class="intro-list" id="list-team">
        <h1>教学队伍</h1>
        <table>
            <tr>
                <th>姓名</th>
                <th>性别</th>
                <th>出生年月</th>
                <th>职称</th>
                <th>学科专业</th>
                <th>在教学中承担的工作</th>
            </tr>
            <tr>
                <td>李伟彤</td>
                <td>男</td>
                <td>1969-10</td>
                <td>副教授</td>
                <td>信号与信息处理</td>
                <td>课程负责人</td>
            </tr>
            <tr>
                <td>刘东峰</td>
                <td>男</td>
                <td>1969-01</td>
                <td>教授</td>
                <td>信号与信息处理</td>
                <td>主讲，负责课程网络建设</td>
            </tr>
            <tr>
                <td>戴青云</td>
                <td>女</td>
                <td>1965-04</td>
                <td>教授</td>
                <td>信号与信息处理</td>
                <td>主讲，负责教材建设</td>
            </tr>
            <tr>
                <td>徐&nbsp杜</td>
                <td>男</td>
                <td>1958-04</td>
                <td>教授</td>
                <td>信号与信息处理</td>
                <td>学科带头人，课程顾问</td>
            </tr>
            <tr>
                <td>骆德汉</td>
                <td>男</td>
                <td>1958-10</td>
                <td>教授</td>
                <td>信号与信息处理</td>
                <td>学科带头人，课程顾问</td>
            </tr>
            <tr>
                <td>何家峰</td>
                <td>男</td>
                <td>1970-08</td>
                <td>副教授</td>
                <td>广东工业大学</td>
                <td>负责实验教学</td>
            </tr>
            <tr>
                <td>蔡&nbsp念</td>
                <td>男</td>
                <td>1976-09</td>
                <td>副教授</td>
                <td>广东工业大学</td>
                <td>负责课程设计</td>
            </tr>
            <tr>
                <td>翁韶伟</td>
                <td>女</td>
                <td>1980-08</td>
                <td>讲师</td>
                <td>广东工业大学</td>
                <td>辅教、负责试题库建设</td>
            </tr>
            <tr>
                <td>孙粤辉</td>
                <td>男</td>
                <td>1979-02</td>
                <td>讲师</td>
                <td>信号与信息处理</td>
                <td>辅教、负责实验教学</td>
            </tr>
            <tr>
                <td>刘&nbsp伟</td>
                <td>男</td>
                <td>1982-01</td>
                <td>讲师</td>
                <td>信号与信息处理</td>
                <td>辅教、负责实验教学</td>
            </tr>
        </table>
        <p>
            《信息论与编码》课程组目前有成员10人，其中教授4人、副教授3人、讲师3人。课题组成员都是专业课教师，80%为中青年教师，90%具有博士学历。成员年龄结构合理，既有长期从事该课程教学研究，具有丰富教学和科研经验的教授和副教授；也有年轻有为的青年讲师作为课程的辅导教师/实验教师，辅导教师/实验教师都至少有5年以上教龄且都同时承担学院的其它专业基础课程，具有一定的教学经验；辅导教师/实验教师与学生比例为1:23。目前青年教师都在积极申请出国研修计划，进一步提高教学和科研水平。课题组计划在两年内选送青年教师到国内著名大学进行深造学习，进一步丰富和提高该课程的教学内容和教学效果，这些都有助于课程建设和教学质量的稳步提高。</p>
    </section>
    <section class="intro-list" id="list-method">
        <h1>教学方法</h1>
        <h3>（一）运用灵活多样的教学手段，积极推进教学改革</h3>
        <p>
            信息论与编码础课程中有大量的经典概念，如熵、信道容量等。这些概念的发展与时俱进，已渗透与其他领域。针对这些重要概念，课程组组织开展了各种专题研讨。以学生为主组织研讨，部分学生作专题发言，全体学生参与讨论。专题研讨的开展巩固了课程中的基本概念，加深了学生对概念本质的理解，培养了学生探索研究的能力。</p>
        <h3>（二）建立学生小组，组织学生进行网络学习</h3>
        <p>
            利用第二课堂安排前沿课题的技术讲座等多种教学手段。观看网络教学录像等，进一步增强了学生对相关知识的理解，提高了国际交流能力。提升了学生知识水平，增强了其参与研究的热情。
        </p>
        <h3>（三）保持授课难度，坚持由浅入深</h3>
        <p>
            对专业课教学新方法的探索一直是本项目关注的课题，针对学生日渐习惯了“填鸭式”教学，养成被动学习的现象，我们认为专业基础课及专业课教学在注重基础的同时，更应注意对学生独立思考习惯和创新意识的启迪与培养。《信息论与编码》课程由于理论性较强，学生在学习过程中感觉有难度。针对这种情况，有人提出“降低难度，简化理论”，这相当于是“将大学教育小学化”。针对这种不良趋势，我们在教学过程中旗帜鲜明地提出了保证教学难度的观点。尝试采用“参与式”教学法为主的授课方式，坚持由浅入深的思路，层层深入。学生在课程学习过程中逐步提升能力，受益匪浅。例如，在香农定理的讲授中，可以首先了解定理内容，逐步把握其本质及对通信工程的指导意义，最后深入探究其推导过程，从整体把握定理全貌。同时，可以通过布置与实际应用关系紧密的练习题与思考题，加大实践环节训练的难度与强度，加深和巩固学生对重点概念和知识的掌握。</p>
        <h3>（四）借助现代教学手段，充分利用网络资源</h3>
        <p>
            通过建立网站，设置一些提问、解答、讨论和资源共享，实现课前预习、课上展示和讲解，课后讨论和评价模式，刺激学生参与感，明显提高教学效果和教学质量。
        </p>
    </section>
</div>

<!--添加页尾-->
<include file="./footer"/>
<script src=<?=base_url().'views/index/index.js'?>></script>
<script src=<?=base_url().'views/introduction/introduction.js'?>></script>
<!--让IE8支持媒体查询-->
<script src="http://apps.bdimg.com/libs/respond.js/1.4.2/respond.js"></script>
</body>
</html>